In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['Anggur','Jeruk','Mangga']
x = [10,20,30]

In [4]:
pd.Series(x,labels)

Anggur    10
Jeruk     20
Mangga    30
dtype: int64

In [25]:
buah = ['Anggur','Jeruk','Mangga',"Apel"]
stok = [20,15,10,5]
harga = [20000,15000,10000,5000]
total = [1,2,3]

In [31]:
pd.DataFrame(list(zip(buah,stok,harga)),'0 1 2 3'.split(),'Nama Stok Harga'.split())

     Nama  Stok  Harga
0  Anggur    20  20000
1   Jeruk    15  15000
2  Mangga    10  10000
3    Apel     5   5000

In [35]:
pd.DataFrame([buah,stok,harga],"a b c".split(),"w x y z".split())

        w      x       y     z
a  Anggur  Jeruk  Mangga  Apel
b      20     15      10     5
c   20000  15000   10000  5000

In [38]:
list(zip(buah,stok,harga))

[('Anggur', 20, 20000),
 ('Jeruk', 15, 15000),
 ('Mangga', 10, 10000),
 ('Apel', 5, 5000)]

In [99]:
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),'A B C D E'.split(),'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df.loc['new']=[1,2,3,4,5]
df

            W         X         Y         Z       new
A    2.706850  0.628133  0.907969  0.503826  3.614819
B    0.651118 -0.319318 -0.848077  0.605965 -0.196959
C   -2.018168  0.740122  0.528813 -0.589001 -1.489355
D    0.188695 -0.758872 -0.933237  0.955057 -0.744542
E    0.190794  1.978757  2.605967  0.683509  2.796762
new  1.000000  2.000000  3.000000  4.000000  5.000000

In [45]:
df['new'] = df['W'] + df['Y']
df

            W         X         Y         Z       new
A    2.706850  0.628133  0.907969  0.503826  3.614819
B    0.651118 -0.319318 -0.848077  0.605965 -0.196959
C   -2.018168  0.740122  0.528813 -0.589001 -1.489355
D    0.188695 -0.758872 -0.933237  0.955057 -0.744542
E    0.190794  1.978757  2.605967  0.683509  2.796762
new  1.000000  2.000000  3.000000  4.000000  4.000000

In [54]:
df.insert(2,'new2',[1,2,3,4,5,6])
df

            W         X  new2         Y         Z       new
A    2.706850  0.628133     1  0.907969  0.503826  3.614819
B    0.651118 -0.319318     2 -0.848077  0.605965 -0.196959
C   -2.018168  0.740122     3  0.528813 -0.589001 -1.489355
D    0.188695 -0.758872     4 -0.933237  0.955057 -0.744542
E    0.190794  1.978757     5  2.605967  0.683509  2.796762
new  1.000000  2.000000     6  3.000000  4.000000  5.000000

In [84]:
df.drop('X',axis=1)

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

In [85]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
df.drop('A',inplace = True)
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
df.reset_index()

  index         W         X         Y         Z
0     B  0.651118 -0.319318 -0.848077  0.605965
1     C -2.018168  0.740122  0.528813 -0.589001
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [96]:
newind = 'INA SG MY PH TH'.split()
newind

['INA', 'SG', 'MY', 'PH', 'TH']

In [101]:
df['Country'] = newind
df

          W         X         Y         Z Country
A  2.706850  0.628133  0.907969  0.503826     INA
B  0.651118 -0.319318 -0.848077  0.605965      SG
C -2.018168  0.740122  0.528813 -0.589001      MY
D  0.188695 -0.758872 -0.933237  0.955057      PH
E  0.190794  1.978757  2.605967  0.683509      TH

In [102]:
df.set_index('Country')

                W         X         Y         Z
Country
INA      2.706850  0.628133  0.907969  0.503826
SG       0.651118 -0.319318 -0.848077  0.605965
MY      -2.018168  0.740122  0.528813 -0.589001
PH       0.188695 -0.758872 -0.933237  0.955057
TH       0.190794  1.978757  2.605967  0.683509

In [103]:
df

          W         X         Y         Z Country
A  2.706850  0.628133  0.907969  0.503826     INA
B  0.651118 -0.319318 -0.848077  0.605965      SG
C -2.018168  0.740122  0.528813 -0.589001      MY
D  0.188695 -0.758872 -0.933237  0.955057      PH
E  0.190794  1.978757  2.605967  0.683509      TH

In [104]:
df.set_index('Country',inplace = True)

In [105]:
df

                W         X         Y         Z
Country
INA      2.706850  0.628133  0.907969  0.503826
SG       0.651118 -0.319318 -0.848077  0.605965
MY      -2.018168  0.740122  0.528813 -0.589001
PH       0.188695 -0.758872 -0.933237  0.955057
TH       0.190794  1.978757  2.605967  0.683509

In [106]:
df

                W         X         Y         Z
Country
INA      2.706850  0.628133  0.907969  0.503826
SG       0.651118 -0.319318 -0.848077  0.605965
MY      -2.018168  0.740122  0.528813 -0.589001
PH       0.188695 -0.758872 -0.933237  0.955057
TH       0.190794  1.978757  2.605967  0.683509